data=read.csv('score3.csv',header=T)
data2=read.table('ws.txt',header=T)
data3=read.table('cp.txt',header=T)
ws1=data2$ws1
ws2=data2$ws2
ws3=data2$ws3
ws2.1=data2$ws2.1

cp1=data3$cp1
cp2=data3$cp2
cp3=data3$cp3
cp4=data3$cp4

EDA=function(x)
{
  par(mfrow=c(2,2))				#同时做4个图
  hist(x);								#直方图
  plot(x);							#点图
  boxplot(x,horizontal=T);			#箱型图
  qqnorm(x);qqline(x);				#QQ图
  par(mfrow=c(1,1))
}
score=data$score
to=data$to
sbj=data$sbj
grade=data$grade
sex=data$sex

EDA(score)


par(mfrow=c(2,2))
y1= table(cp1)
names(y1)=c('差','不满意', "一般 ",'不错',"非常好 ")	#将分类标志改成文字
barplot(y1,col= c ("red",'yellow','blue','white','purple'),main='对工作人员个人卫生的满意度')

y2= table(cp2)
names(y2)=c('差','不满意', "一般 ",'不错',"非常好 ")	#将分类标志改成文字
barplot(y2,col= c ("red",'yellow','blue','white','purple'),main='对餐具卫生的满意度')

y3= table(cp3)
barplot(y3)
names(y3)=c('非常不满意','不满意', "一般 ",'比较满意',"非常满意 ")	#将分类标志改成文字
barplot(y3,col= c ("red",'yellow','blue','white','purple'),main='对工作人员个人卫生的满意度')

y4= table(cp4)
names(y4)=c('差','不满意', "一般 ",'不错',"非常好 ")	#将分类标志改成文字
barplot(y4,col= c ("red",'yellow','blue','white','purple'),main='对就餐环境卫生的满意度')

par(mfrow=c(1,1))
B_1 <- cut(B1, breaks = c(0, 60, 70, 80, 90, 100)*0.3)#分组
B1_level=ordered(B_1, labels = c('bad', 'ok', 'average', 'good', 'excellent')) 
y5=table(B1_level)
names(y5)=c('差','不满意', "一般 ",'不错',"非常好 ")	#将分类标志改成文字
barplot(y5,col= c ("red",'yellow','blue','white','purple'),main='对食堂卫生的总满意度')



#data=data[!(score>100),]
#head(data[(score>100),])

#条形图
par(mfrow=c(2,2))
y1= table(ws1)
names(y1)=c('差','不满意', "一般 ",'不错',"非常好 ")	#将分类标志改成文字
barplot(y1,col= c ("red",'yellow','blue','white','purple'),main='对工作人员个人卫生的满意度')

y2= table(ws2)
names(y2)=c('差','不满意', "一般 ",'不错',"非常好 ")	#将分类标志改成文字
barplot(y2,col= c ("red",'yellow','blue','white','purple'),main='对餐具卫生的满意度')

#y3= table(ws2.1)
#barplot(y3)
#names(y3)=c('非常不满意','不满意', "一般 ",'比较满意',"非常满意 ")	#将分类标志改成文字
#barplot(y3,col= c ("red",'yellow','blue','white','purple'),main='对工作人员个人卫生的满意度')

y4= table(ws3)
names(y4)=c('差','不满意', "一般 ",'不错',"非常好 ")	#将分类标志改成文字
barplot(y4,col= c ("red",'yellow','blue','white','purple'),main='对就餐环境卫生的满意度')

B_2 <- cut(B2, breaks = c(0, 60, 70, 80, 90, 100)*0.4)#分组
B2_level=ordered(B_2, labels = c('bad', 'ok', 'average', 'good', 'excellent')) 
y5=table(B2_level)
names(y5)=c('差','不满意', "一般 ",'不错',"非常好 ")	#将分类标志改成文字
barplot(y5,col= c ("red",'yellow','blue','white','purple'),main='对食堂卫生的总满意度')

par(mfrow=c(1,1))


mean(score)
mean(score,trim=0.2)				#去除数据前后各20%的数据
median(score)
y=score
max(y)
min(y)
sd(y)

#编写函数变异系数
cv<-function(x){				
  sd(x)/mean(x)
}
cv(y)

mean(B1)/0.3
mean(B2)/0.4
mean(B3)/0.1
mean(B4)/0.2


X<-data.frame(
  x1=c(2959.19,2459.77,1495.63,1046.33,1303.97,1730.84,
       1561.86,1410.11,3712.31,2207.58,2629.16,1844.78,
       2709.46,1563.78,1675.75,1427.65,1783.43,1942.23,
       3055.17,2033.87,2057.86,2303.29,1974.28,1673.82,
       2194.25,2646.61,1472.95,1525.57,1654.69,1375.46,
       1608.82),
  x2=c(730.79,495.47,515.90,477.77,524.29,553.90,492.42,
       510.71,550.74,449.37,557.32,430.29,428.11,303.65,
       613.32,431.79,511.88,512.27,353.23,300.82,186.44,
       589.99,507.76,437.75,537.01,839.70,390.89,472.98,
       437.77,480.99,536.05),
  x3=c(749.41,697.33,362.37,290.15,254.83,246.91,200.49,
       211.88,893.37,572.40,689.73,271.28,334.12,233.81,
       550.71,288.55,282.84,401.39,564.56,338.65,202.72,
       516.21,344.79,461.61,369.07,204.44,447.95,328.90,
       258.78,273.84,432.46),
  x4=c(513.34,302.87,285.32,208.57,192.17,279.81,218.36,
       277.11,346.93,211.92,435.69,126.33,160.77,107.90,
       219.79,208.14,201.01,206.06,356.27,157.78,171.79,
       236.55,203.21,153.32,249.54,209.11,259.51,219.86,
       303.00,317.32,235.82),
  x5=c(467.87,284.19,272.95,201.50,249.81,239.18,220.69,
       224.65,527.00,302.09,514.66,250.56,405.14,209.70,
       272.59,217.00,237.60,321.29,811.88,329.06,329.65,
       403.92,240.24,254.66,290.84,379.30,230.61,206.65,
       244.93,251.08,250.28),
  x6=c(1141.82,735.97,540.58,414.72,463.09,445.20,459.62,
       376.82,1034.98,585.23,795.87,513.18,461.67,393.99,
       599.43,337.76,617.74,697.22,873.06,621.74,477.17,
       730.05,575.10,445.59,561.91,371.04,490.90,449.69,
       479.53,424.75,541.30),
  x7=c(478.42,570.84,364.91,281.84,287.87,330.24,360.48,
       317.61,720.33,429.77,575.76,314.00,535.13,509.39,
       371.62,421.31,523.52,492.60,1082.82,587.02,312.93,
       438.41,430.36,346.11,407.70,269.59,469.10,249.66,
       288.56,228.73,344.85),
  x8=c(457.64,305.08,188.63,212.10,192.96,163.86,147.76,
       152.85,462.03,252.54,323.36,151.39,232.29,160.12,
       211.84,165.32,182.52,226.45,420.81,218.27,279.19,
       225.80,223.46,191.48,330.95,389.33,191.34,228.19,
       236.51,195.93,214.40)
)
>d<-dist(scale(X))
>h<-hclust(d)
# 绘图
>plclust(h)
#31 个样本分为 5 个 类
>r<-rect.hclust(h,5)






